% heuristica problema 3
% resulve la heuristica del primer proyecto de Investigación de Operaciones



P=10;
V=[54 129 155 559 10 10; 
120 195 258 744 10 10;
14	89 98 510 30 30;
21	96 106	521	30 30;
35	110	123	555	30 30;
45	120	135	576	30 30;
49	124	138	577	30 30;
51	126	140	573	30 30;
60	135	150	591	30 30;
85 160	180	657	30 30];

S=[99999	3	15	15	15	15	15	15	15	15;
3	99999	15	15	15	15	15	15	15	15;
15	15	99999	8	8	8	8	8	8	8;
15	15	8	99999	8	8	8	8	8	8;
15	15	8	8	99999	8	8	8	8	8;
15	15	8	8	8	99999	8	8	8	8;
15	15	8	8	8	8	99999	8	8	8;
15	15	8	8	8	8	8	99999	8	8;
15	15	8	8	8	8	8	8	99999	8;
15	15	8	8	8	8	8	8	8	99999];


%R es el número de pistas
%V matriz de datos
%S matriz de 
%P numero de aviones

R=3;

heuristica3(P,R,S,V)






